Repository: Andrew1013-development/agenda-manager
Catalog: AgendaLibrary/Resources/Localization/AgendaLibrary.*.resx
Languages: vi

# agenda
source: agendas
vi: dặn dò

# agenda_available
source: Agendas available
vi: Dặn dò để làm

# agenda_database
source: Agendas on database
vi: Số dặn dò trên cơ sở dữ liệu

# agenda_prune
source: Agendas to be pruned
vi: Số dặn dò để xóa

# backup_old
source: Creating backup of the old version.....
vi: Tạo bản sao phiên bản cũ.....

# backup_old_finish
source: Old backup is created.
vi: Bản sao đã tạo.

# bug_report
source: Uploading bug report.....
vi: Đang tải lên báo cáo lỗi.....

# bug_report_finish
source: Bug reported! Thanks for your feedback!
vi: Lỗi đã được báo cáo! Cảm ơn phản hồi của bạn!

# bug_report_role
source: Report a bug
vi: Báo cáo lỗi trong chương trình

# bug_report_tip
source: TIP: Press Enter twice to denote the end of input, type with lines freely
vi: MẸO: Nhấn Enter 2 lần để đánh dấu kết thúc đầu vào, gõ cách hàng thoải mái

# check_old_update
source: Checking if old update exists.....
vi: Kiểm tra nếu bản cũ tồn tại.....

# check_old_updater
source: Checking if old updater exists.....
vi: Kiểm tra nếu trình cập nhật cũ vẫn tồn tại.....

# check_update
source: Checking for available updates.....
vi: Kiểm tra cập nhật.....

# check_update_error
source: Cannot check for updates.
vi: Không thể kiểm tra cập nhật.

# command_entered
source: Command you entered
vi: Lệnh bạn gõ vào

source: Content
vi: Nội dung

source: Continue
vi: Tiếp tục

# continue_1_second
source: Continuing in 1 second.....
vi: Tiếp tục trong 1 giây.....

# create_log
source: Creating log file.....
vi: Tạo tệp theo dõi.....

# create_log_finish
source: Logging file created.
vi: Tệp theo dõi đã tạo.

# credits_role
source: View credits
vi: Xem danh sách người tham gia trong hoạt động làm chương trình

# current_date_time
source: Current date and time
vi: Ngày và thời gian hiện tại

source: Current settings
vi: Cài đặt hiện tại

source: Deadline
vi: Hạn chót

source: Debug status
vi: Tình trạng debug

# debug_warning
source: THIS IS A DEBUG BUILD, PERFORMANCE WILL BE REDUCED, USE WITH CAUTION.
vi: ĐÂY LÀ BẢN DEBUG, HIỆN NĂNG SẼ GIẢM, SỬ DỤNG VỚI SỰ CẨN THẬN.

# delete_old_update
source: Old update found, deleting.....
vi: Bản cũ đã tìm thấy, xóa.....

# delete_old_updater
source: Old updater is found, deleting.....
vi: Trình cập nhật cũ đã tìm thấy, xóa.....

# delete_old_updater_finish
source: Old updater deleted.
vi: Trình cập nhật cũ đã xóa.

# delete_old_update_finish
source: Old update deleted.
vi: Bãn cũ đã xóa.

# download_update
source: Downloading update.....
vi: Tải về bản cập nhật.....

# download_updater
source: Downloading updater.....
vi: Tải về trình cập nhật.....

# download_updater_error
source: Cannot download updater to perform update.
vi: Không thể tải xuống trình cập nhật để bắt đầu quá trình cập nhật.

# download_updater_finish
source: Finished downloading updater.
vi: Đã tải xong trình cập nhật.

# download_update_error
source: Cannot download update file.
vi: Không thể tải về bản cập nhật

# download_update_finish
source: Update downloaded.
vi: Bản cập nhật đã tải về.

# early_date_error
source: Date cannot be earlier than or equal to today.
vi: Ngày tháng không thể sớm hơn hoặc bằng hôm nay

# empty_bug_name_error
source: Bug description cannot be empty.
vi: Mô tả lỗi không thể trống.

# empty_bug_reproduction_error
source: Bug reproduction cannot be empty.
vi: Mô tả làm lại lỗi không thể trống.

# empty_content_error
source: Content cannot be empty.
vi: Nôi dung không được trống.

# empty_date_error
source: Date cannot be empty.
vi: Ngày tháng không được trống.

# empty_role_warning
source: Role input cannot be empty.
vi: Lựa chọn thao tác không thể trống.

# empty_subject_error
source: Subject cannot be empty.
vi: Môn học không được trống.

# establish_connection
source: Establishing connection to database.....
vi: Kết nối đến cơ sở dữ liệu.....

# establish_connection_finish
source: Connection to database established.
vi: Đã kết nối đến cơ sở dữ liệu.

source: Exit
vi: Thoát

source: Exiting.....
vi: Thoát.....

# exit_or_continue_program
source: Exit or continue using?
vi: Thoát hay tiếp tục sử dụng?

# exit_or_continue_settings
source: Exit or continue in this section?
vi: Thoát hay tiếp tục trong mục này?

# exit_role
source: Exiting (exit the program)
vi: Thoát (thoát chương trình)

# fetch_database
source: Fetching agenda database.....
vi: Lấy các dặn dò từ cơ sở dữ liệu.....

# help_role
source: Summon Help (not finished yet)
vi: Mở Trợ giúp (chưa hoàn thành)

# install_update
source: Installing update.....
vi: Cài đặt bản cập nhật.....

# install_update_error
source: Cannot install update.
vi: Không thể cài đặt bản cập nhật

# install_update_finish
source: Update installed.
vi: Bản cập nhật đã cài đặt

# invalid_date_error
source: Date entered does not translate to a valid day.
vi: Ngày tháng gõ vào không thể chuyển đổi thành ngày tháng hợp lệ.

# invalid_option_error_program
source: Invalid option specified, defaulting to continue execution.
vi: Lựa chọn không hợp lệ đã chọn, mặc định tiếp tục.

# invalid_option_error_settings
source: Invalid option specified, defaulting to exiting this section.
vi: Lựa chọn không hợp lệ đã chọn, mặc định thoát mục này.

# invalid_role_error
source: Invalid role specified.
vi: Thao tác không hợp lệ đã chọn.

source: Language
vi: Ngôn ngữ

# latest_update_name
source: The latest release version name
vi: Phiên bản mới nhất

# latest_version
source: Latest version available
vi: Bản cập nhật mới nhất

source: library
vi: thư viện bản

# main_dev
source: Main developer
vi: Nhà phát triển chính

# modify_debug
source: Modify debug mode settings
vi: Thay đổi trạng thái gỡ lỗi trong chương trình

# modify_language
source: Modify language settings
vi: Thay đổi ngôn ngữ chương trình

# new_update
source: Update detected, ready to install and update.
vi: Đã có bản cập nhật mới, sẵn sàng để cài đặt và cập nhật.

source: Notes
vi: Ghi chú

# no_new_update
source: Your program is updated.
vi: Chương trình của bạn đã được cập nhật.

# no_old_update
source: No old update found, downloading new update.
vi: Không tìm thấy bản cũ, tải xuống bản mới.

# no_old_updater
source: No old updater is found, downloading new one.
vi: Không tìm thấy trình cập nhật cũ, tải về bản mới.

# number_specified
source: Option specified
vi: Lựa chọn được chọn

source: Pruned
vi: Đã xóa

# pruner_role
source: Pruner (pruning old out-of-date agendas from database)
vi: Tỉa (Xóa bỏ các dặn dò lỗi thời trong cơ sở dữ liệu)

source: Pruning
vi: Đang xóa

# receiver_role
source: Receiver (receiving upcoming agendas from database)
vi: Nhận (nhận các dặn dò từ cơ sở dữ liệu)

# release_description
source: Description of release
vi: Mô tả phiên bản mới nhất

# release_url
source: URL of release
vi: URL phiên bản mới nhất

source: Role selected
vi: Thao tác chọn

source: Role selection
vi: Các lựa chọn thao tác

# rollback_update
source: Rolling back to old version.....
vi: Quay về bản cũ.....

# rollback_update_finish
source: Rolled back to old version.
vi: Đã quay về bản cũ

# secret_shell_access
source: You have accessed the secret menu!
vi: Bạn đã truy cập vào menu bí mật!

# secret_shell_note
source: This is just a shell in testing, type 'exit' to exit the shell.
vi: Đây chỉ là môi trường mã lệnh thử nghiệm, gõ lệnh "exit" để thoát

# setting_role
source: Change settings
vi: Chỉnh sửa cài đặt

# setup_json
source: Setting up JSON writer.....
vi: Đang tạo trình viết JSON.....

# setup_json_finish
source: JSON writer set up.
vi: Trình viết JSON đã tạo.

# specify_number
source: Enter a number corresponding to the option you want to select.
vi: Hãy chọn một số gắn với lựa chọn bạn muốn chọn

# specify_password
source: Specify your password
vi: Gõ mật mã

# specify_role
source: Specify your role in the designated number above
vi: Chọn thao tác bạn muốn làm tương ứng với các số trên

# specify_role_settings
source: Specify what settings to modify in the designated numbers above
vi: Lựa chọn cài đặt để thay đổi theo các số trên

# started_up
source: started up in
vi: bật lên trong

source: Subject
vi: Môn học

source: Testers
vi: Những người kiểm duyệt phần mềm

# updater_thread
source: Setting up thread for updater download.....
vi: Tạo luồng để tải trình cập nhật.....

# updater_thread_finish
source: Updater thread set up.
vi: Luồng tải trình cập nhật đã tạo.

source: Update description
vi: Mô tả bản cập nhật

# update_role
source: Check for updates
vi: Kiểm tra cập nhật

source: Update URL
vi: Link bản cập nhật

# uploader_role
source: Uploader (uploading agendas to database)
vi: Tải lên (tải lên các dặn dò lên cơ sở dữ liệu)

# upload_agenda
source: Uploading agenda to database.....
vi: Tải lên dặn dò lên cơ sở dữ liệu.....

# upload_agenda_finish
source: Uploaded agenda to database.
vi: Đã tải lên dặn dò lên cơ sở dữ liệu.

# wait_to_start
source: Waiting 3 seconds until starting up.....
vi: Chờ 3 giây để bật lên.....

# wait_update
source: Waiting 30 seconds for Agenda Manager to fully quit exiting (for safety).....
vi: Chờ 30 giây để Agenda Manager thoát (cho sự an toàn).....

# welcome
source: Welcome to Agenda Manager
vi: Chào mừng đến với Agenda Manager bản

# work_in_progress
source: This function is still work-in-progress.
vi: Chức năng này vẫn đang được phát triển.

# wrong_password
source: Wrong password entered.
vi: Mật mã sai.
